SOAP/resources/catalog/Calculator_Envelope.xml

<?xml version="1.0" encoding="utf-8"?>
<!--SOAP envelope consumed by the service at http://www.dneonline.com/calculator.asmx.
It calls the method Operator and takes as inputs: (i) intA and (ii) intB-->
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
    	<Operator xmlns="http://tempuri.org/">
     	 <intA xmlns="http://tempuri.org/">?</intA>
     	 <intB xmlns="http://tempuri.org/">?</intB>
    	</Operator>
  	</soap:Body>
</soap:Envelope>